{
  "backend/main.mo": "Motoko actor providing blob storage, access control, user profiles, editable website content, and admin-managed project CRUD.",
  "feature_evidence.json": "Feature evidence report mapping features to affected frontend files and components with metadata.",
  "frontend-file-summaries.txt": "Text file listing short summaries of various frontend files for reference.",
  "frontend/index.css": "Global Tailwind/OKLCH theme defining black, yellow, and metallic design tokens for light and dark modes.",
  "frontend/index.html": "HTML entrypoint setting metadata, dark mode, Inter font, and mounting the React app.",
  "frontend/src/App.tsx": "Sets up TanStack Router with public and admin routes and shared header layout.",
  "frontend/src/components/admin/ContentEditor.tsx": "Admin UI for editing website content including hero, services, clients, and contact sections.",
  "frontend/src/components/admin/ProjectsEditor.tsx": "Admin tool for viewing, creating, editing, and deleting projects with image upload handling and progress tracking.",
  "frontend/src/components/auth/AccessDenied.tsx": "Displays an access denied message with a login button for unauthorized users.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides sign-in/out logic using Internet Identity with loading and error handling.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting new users to enter and save their display name.",
  "frontend/src/components/site/AboutSection.tsx": "Renders the About Us section using provided company description and feature icons.",
  "frontend/src/components/site/ClientsSection.tsx": "Shows a grid of client entries from website content.",
  "frontend/src/components/site/ContactSection.tsx": "Displays contact details including address, owner, phone, and email.",
  "frontend/src/components/site/Footer.tsx": "Footer with copyright text and link attribution.",
  "frontend/src/components/site/HeroSection.tsx": "Hero banner with headline, subheadline, background image, and call‑to‑action buttons.",
  "frontend/src/components/site/MaterialsSection.tsx": "Presents a description of materials the company works with.",
  "frontend/src/components/site/MetallicSurface.tsx": "Styled container component applying metallic-themed gradients and effects.",
  "frontend/src/components/site/PortfolioSection.tsx": "Displays project portfolio grid with loading and empty states.",
  "frontend/src/components/site/ProjectCard.tsx": "Displays a clickable project card with image, title, description, and a dialog showing full project details.",
  "frontend/src/components/site/ServicesSection.tsx": "Renders a services grid using provided website content, showing service names and descriptions.",
  "frontend/src/components/site/SiteHeader.tsx": "Implements the site header with navigation links, logo, and mobile menu using smooth scrolling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login, state management, and identity persistence via a React context provider.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating content, projects, user profiles, and admin authorization via the actor.",
  "frontend/src/index.css": "Tailwind base styles with themed CSS variables, dark mode settings, global styles, and custom scrollbars.",
  "frontend/src/main.tsx": "Initializes the React app with QueryClient and InternetIdentityProvider, then renders the root component.",
  "frontend/src/pages/Admin.tsx": "Admin dashboard that handles auth, profile setup, admin checks, and provides tabs for editing content and projects.",
  "frontend/src/pages/PublicSite.tsx": "Renders the public website by loading content and projects, showing skeletons while loading, and assembling all site sections.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read, store, retrieve, and clear URL or session-based parameters, including hash routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks current project state, requirements, branding notes, images needed, and implemented features for the website build."
}